Repository: putritheresia21/gluco-track
Catalog: lib/l10n/app_*.arb
Languages: id

# noDataCategory
source: No data for category ''{category}''
id: Tidak ada data kategori ''{category}''

# noHistoryData
source: No history data yet
id: Belum ada riwayat data

# noDataAnalysis
source: No data this week for analysis.
id: Belum ada data minggu ini untuk dianalisis.

# glucoseStability
source: Blood Glucose Stability
id: Stabilitas Gula Darah

source: Attention Required
id: Perhatian Diperlukan

# highGlucoseTrend
source: Your glucose trend is high this week. Over 50% of records are above normal.
id: Minggu ini gula darah Anda cenderung tinggi. Lebih dari 50% pencatatan di atas normal.

source: Hypoglycemia Alert
id: Waspada Hipoglikemia

# lowGlucoseTrend
source: Frequent low glucose detected. Ensure regular meals and consult a doctor.
id: Terdeteksi sering terjadi kadar gula rendah. Pastikan makan teratur dan konsultasi dokter.

source: Good Job!
id: Kerja Bagus!

# stableGlucoseMessage
source: Your glucose is well-controlled this week. Keep up your healthy lifestyle.
id: Gula darah Anda sangat terkendali minggu ini. Pertahankan pola hidup sehat Anda.

source: Fairly Stable
id: Cukup Stabil

# stableVariationMessage
source: Your glucose variation is within reasonable limits. Average this week is {avg} mg/dL.
id: Variasi gula darah Anda dalam batas wajar. Rata-rata minggu ini {avg} mg/dL.

source: Average
id: Rata-rata

source: Who can reply?
id: Siapa yang bisa membalas?

# whoCanReplySubtitle
source: Pick who can reply to this post.
id: Pilih siapa yang bisa membalas postingan ini.

source: Everyone
id: Semua orang

source: Followers Only
id: Hanya pengikut

source: Discard post?
id: Buang postingan?

# discardPostMessage
source: This can't be undone and you'll lose your draft.
id: Ini tidak bisa dibatalkan dan draf Anda akan hilang.

source: Discard
id: Buang

source: Add New Post
id: Tambah Postingan Baru

source: Share
id: Bagikan

source: Write something here....
id: Tulis sesuatu di sini....

# characterCount
source: {count, plural, =1{{count} character} other{{count} characters}}
id: {count, plural, =1{{count} karakter} other{{count} karakter}}

# manualGlucoseTask
source: {count}x Manual Glucose Recording
id: {count}x Pencatatan Manual Gula Darah

# iotGlucoseTask
source: {count}x IoT Glucose Recording
id: {count}x Pencatatan IoT Gula Darah

# socialPostTask
source: {count}x Post updates on Social Feeds
id: {count}x Posting pembaruan di Media Sosial

# tasksProgress
source: {completed}/{total} Tasks
id: {completed}/{total} Tugas

source: Completed
id: Selesai

source: Claim
id: Klaim

source: Just now
id: Baru saja

# minsAgo
source: {count} mins ago
id: {count} menit yang lalu

# hoursAgo
source: {count} hours ago
id: {count} jam yang lalu

# daysAgo
source: {count} days ago
id: {count} hari yang lalu

source: Monitoring
id: Pemantauan

source: All data displayed
id: Semua data telah ditampilkan

source: No data this week
id: Belum ada data minggu ini

source: No data this month
id: Belum ada data bulan ini

source: Your Missions
id: Misi Anda

# optionalTaskInfo
source: These tasks are optional. Complete them to get special rewards!
id: Task ini bersifat opsional. Selesaikan untuk mendapat reward spesial!

# manualGlucoseTaskTitle
source: Manual Blood Glucose Recording
id: Pencatatan Gula Darah Manual

# manualGlucoseTaskDesc
source: Record your blood glucose level manually using a glucometer
id: Catat kadar gula darah Anda secara manual menggunakan glucometer

# iotGlucoseTaskTitle
source: IoT Blood Glucose Recording
id: Pencatatan Gula Darah dengan IoT

# iotGlucoseTaskDesc
source: Record your blood glucose level using an IoT device
id: Catat kadar gula darah Anda menggunakan perangkat IoT

# socialPostTaskTitle
source: Post on Social Feeds
id: Posting di Social Feeds

# socialPostTaskDesc
source: Share your experience on social feeds
id: Bagikan pengalaman Anda di social feeds

source: See Detail
id: Lihat Detail

source: Tasks
id: Tugas

# editProfileTitle
source: Edit Profile
id: Edit Profil

source: Change Photo
id: Ganti Foto

source: Choose from Gallery
id: Pilih dari Galeri

source: Take Photo
id: Ambil Foto

source: Save Changes
id: Simpan Perubahan

# profileUpdated
source: Profile updated successfully
id: Profil berhasil diperbarui

# updateFailed
source: Failed to update profile
id: Gagal memperbarui profil
