Repository: putritheresia21/gluco-track
Catalog: lib/l10n/app_*.arb
Languages: id

source: Hello,
id: Halo,

source: Total Records
id: Total Catatan

source: Weekly Summary
id: Ringkasan Mingguan

source: Lowest
id: Terendah

source: Highest
id: Tertinggi

source: Your Mission
id: Misi Anda

source: view all
id: lihat semua

source: Notifications
id: Notifikasi

source: Last 7 Days
id: 7 Hari Terakhir

# logoutConfirm
source: Logout Confirmation
id: Konfirmasi Logout

# logoutMessage
source: Are you sure you want to logout?
id: Apakah Anda yakin ingin logout?

source: Cancel
id: Batal

# yearsOld
source: {age} years old
id: {age} tahun

source: Points
id: Poin

source: Days Streak
id: Hari Beruntun

source: Missions Completed
id: Misi Selesai

source: Your Next Mission
id: Misi Berikutnya

source: No missions available
id: Belum ada misi tersedia

source: Edit Profile
id: Edit Profil

source: Loading...
id: Memuat...

source: No data yet
id: Belum ada data

source: Before Meal
id: Sebelum Makan

source: After Meal
id: Sesudah Makan

source: at
id: pada jam

# shareResult
source: Record Saved
id: Bagikan Hasil

# shareResultMessage
source: Do you want to share your current blood glucose test results?
id: Apakah Anda ingin membagikan hasil tes gula darah Anda saat ini?

source: No
id: Tidak

source: Yes, Share
id: Ya, Bagikan

# selectDateTimeFirst
source: Select date and time first.
id: Pilih tanggal dan waktu terlebih dahulu.

# glucoseDataSaved
source: Glucose data saved successfully.
id: Data glukosa berhasil disimpan.

# failedSaveDatabase
source: Failed to save data to database.
id: Gagal menyimpan data ke database.

# failedSaveData
source: Failed to save data: {error}
id: Gagal menyimpan data: {error}

source: Glucose Record
id: Catatan Glukosa

# glucoseLevelMgDl
source: Blood Glucose Level (mg/dL)
id: Kadar Gula Darah (mg/dL)

# glucoseLevelRequired
source: Glucose level cannot be empty
id: Kadar gula darah tidak boleh kosong

# validNumberRequired
source: Enter a valid number
id: Masukkan angka yang valid

# iotDataLoaded
source: IoT data loaded successfully
id: Data dari IoT berhasil dimuat

source: Automatic
id: Otomatis

source: IoT Device Data
id: Data dari Perangkat IoT

source: Measurement Condition
id: Kondisi Waktu Pengukuran

source: Use Current Time
id: Gunakan Waktu Saat ini

source: Select Date & Time
id: Pilih Tanggal & Waktu

source: Date & Time:
id: Tanggal & Waktu:

source: Save
id: Simpan

# whatsUp
source: What's up, {name}!
id: Apa kabar, {name}!

source: Have anything to share?
id: Ada yang ingin dibagikan?

# searchHint
source: Search posts, articles, or users...
id: Cari kiriman, artikel, atau pengguna...

source: For you
id: Untuk Anda

source: News
id: Berita

# failedTriggerEsp32
source: Failed to send trigger to ESP32
id: Gagal mengirim trigger ke ESP32

# timeoutEsp32
source: Timeout: ESP32 not responding
id: Timeout: ESP32 tidak merespons

source: Measure Again
id: Ukur Lagi

source: Start Measurement
id: Mulai Pengukuran

# checkGlucoseNow
source: Check your glucose now!
id: Cek gula darahmu sekarang!

source: Start
id: Mulai

source: Measurement Process
id: Proses Pengukuran

source: Measurement Result
id: Hasil Pengukuran

source: Confidence:
id: Keyakinan:

# continueText
source: Continue
id: Lanjutkan

source: Measurement Failed
id: Pengukuran Gagal

# articleDetail
source: Article's Detail
id: Detail Artikel

source: Social
id: Sosial

source: Social Media Feed
id: Umpan Media Sosial

source: IoT Connection
id: Koneksi IOT

source: testing social media
id: testing sosmed

source: Write something first
id: Tulis sesuatu dulu

source: Posted!
id: Berhasil dikirim!

# failedToPost
source: Failed to post: {error}
id: Gagal mengirim: {error}

source: Post
id: Kirim

# failedToLoadFeed
source: Failed to load feed: {error}
id: Gagal memuat feed: {error}

# writeSomethingOrAddImage
source: Write something or add an image
id: Tulis sesuatu atau tambahkan gambar

# failedToCreateImage
source: Failed to create image: {error}
id: Gagal membuat gambar: {error}

# failedToShare
source: Failed to share: {error}
id: Gagal membagikan: {error}

# congratulationsPoints
source: Congratulations! You earned {points} points
id: Selamat! Anda mendapat {points} poin

source: Failed to claim points
id: Gagal klaim poin

source: Follow
id: Ikuti

source: Following
id: Diikuti

# article1Title
source: Exercise: The Medicine You Can't Skip.
id: Olahraga: Obat yang Tidak Boleh Anda Lewatkan.

# article1Preview
source: Stay active to boost both body and brain. Skipping workouts means missing your health.
id: Tetap aktif untuk meningkatkan kesehatan tubuh dan otak. Melewatkan olahraga berarti mengabaikan kesehatan Anda.

# article1Caption
source: Stay active to boost both body and brain. Skipping workouts means skipping your health.
id: Tetap aktif untuk meningkatkan kesehatan tubuh dan otak. Melewatkan olahraga berarti mengabaikan kesehatan Anda.

# article1Content
source: When people think about medicine, they usually imagine pills, capsules, or doctor's prescriptions. But here's the truth—one of the most powerful medicines you can ever give your body doesn't come from a pharmacy. It comes from movement. Exercise is the kind of medicine you can't skip, because it works on every part of your health, from your heart and lungs to your mood and mental clarity. Think about it: just 20–30 minutes of physical activity a day can improve blood circulation, strengthen muscles, and lower the risk of chronic diseases. But it's not just about the body—your brain benefits too. Regular workouts release endorphins, reduce stress, and even sharpen focus. In short, moving your body isn't just about staying fit; it's about staying alive and thriving. The best part? You don't need an expensive gym membership or fancy equipment to start. A brisk walk, a quick home workout, or even stretching while watching TV can make a real difference. What matters most is consistency. Small steps done daily will bring more results than pushing yourself hard once a month. So, the next time you feel like skipping exercise, remember this: you're not just skipping a workout—you're skipping an opportunity to invest in your future health. Treat movement like medicine, because your body and brain truly can't function at their best without it.
id: Saat orang memikirkan obat, mereka biasanya membayangkan pil, kapsul, atau resep dokter. Namun inilah kenyataannya—salah satu obat paling ampuh yang pernah Anda berikan kepada tubuh Anda tidak berasal dari apotek. Itu berasal dari gerakan. Olahraga adalah jenis obat yang tidak boleh Anda lewatkan, karena ia bekerja pada setiap bagian kesehatan Anda, mulai dari jantung dan paru-paru hingga suasana hati dan kejelasan mental Anda. Coba pikirkan: hanya 20–30 menit aktivitas fisik sehari dapat meningkatkan sirkulasi darah, memperkuat otot, dan menurunkan risiko penyakit kronis. Namun bukan hanya tubuh—otak Anda juga memanfaatkannya. Olahraga teratur melepaskan endorfin, mengurangi stres, dan bahkan mempertajam fokus. Singkatnya, menggerakkan tubuh bukan hanya tentang tetap bugar; ini tentang tetap hidup dan berkembang. Bagian terbaiknya? Anda tidak butuh keanggotaan gym yang mahal atau peralatan canggih untuk memulai. Jalan cepat, olahraga singkat di rumah, atau bahkan peregangan sambil menonton TV bisa memberikan perbedaan nyata. Yang paling penting adalah konsistensi. Langkah kecil yang dilakukan setiap hari akan membawa lebih banyak hasil daripada memaksakan diri keras sebulan sekali. Jadi, lain kali Anda merasa ingin melewatkan olahraga, ingatlah ini: Anda tidak hanya melewatkan latihan—Anda sedang melewatkan kesempatan untuk berinvestasi dalam kesehatan masa depan Anda. Anggaplah gerakan sebagai obat, karena tubuh dan otak Anda benar-benar tidak dapat berfungsi maksimal tanpanya.

# article2Title
source: Healthy Plates, Healthy Life
id: Piring Sehat, Hidup Sehat

# article2Preview
source: Balance your meals with color and variety. Small changes bring big results.
id: Seimbangkan makanan Anda dengan warna dan variasi. Perubahan kecil membawa hasil besar.

# article2Caption
source: Balance your meals with color and variety. Small changes bring big results.
id: Seimbangkan makanan Anda dengan warna dan variasi. Perubahan kecil membawa hasil besar.

# article2Content
source: A healthy lifestyle begins with the food you choose every day. Building a balanced plate doesn't have to be complicated—just focus on variety and moderation. By including colorful fruits and vegetables, lean proteins, whole grains, and healthy fats, you can give your body what it needs to stay strong and energized. The more color you add to your meals, the more nutrients you introduce into your diet. Foods with rich natural colors—like leafy greens, carrots, berries, and peppers—are packed with vitamins, minerals, and antioxidants that support overall well-being. A colorful plate is not only healthier but also more enjoyable to eat. Portion control is another key to healthy eating. You don't need to remove all your favorite foods, but you can reduce excess sugar, salt, and unhealthy fats. Try using smaller plates, add more vegetables, and avoid overeating by listening to your body's hunger cues. Small changes, like swapping white rice for brown rice or choosing grilled instead of fried foods, can make a big difference over time. These simple adjustments can support better digestion, stable energy levels, and improved long-term health. Remember that healthy eating is a journey, not a diet. The goal is progress—not perfection. When you make mindful choices consistently, you'll feel better, stronger, and more confident in your daily life.
id: Gaya hidup sehat dimulai dari makanan yang Anda pilih setiap hari. Membangun piring yang seimbang tidak harus rumit—fokus saja pada variasi dan moderasi. Dengan menyertakan buah-buahan dan sayuran berwarna-warni, protein tanpa lemak, biji-bijian utuh, dan lemak sehat, Anda dapat memberikan apa yang dibutuhkan tubuh untuk tetap kuat dan bertenaga. Semakin banyak warna yang Anda tambahkan ke makanan Anda, semakin banyak nutrisi yang Anda masukkan ke dalam diet Anda. Makanan dengan warna alami yang kaya—seperti sayuran hijau, wortel, beri, dan paprika—penuh dengan vitamin, mineral, dan antioksidan yang mendukung kesejahteraan secara keseluruhan. Piring yang penuh warna bukan hanya lebih sehat tetapi juga lebih nikmat untuk dimakan. Kontrol porsi adalah kunci lain untuk makan sehat. Anda tidak perlu menghilangkan semua makanan favorit Anda, tetapi Anda dapat mengurangi kelebihan gula, garam, dan lemak tidak sehat. Coba gunakan piring yang lebih kecil, tambahkan lebih banyak sayuran, dan hindari makan berlebihan dengan mendengarkan sinyal lapar tubuh Anda. Perubahan kecil, seperti menukar nasi putih dengan nasi merah atau memilih makanan yang dipanggang daripada digoreng, dapat memberikan perbedaan besar seiring waktu. Penyesuaian sederhana ini dapat mendukung pencernaan yang lebih baik, tingkat energi yang stabil, dan peningkatan kesehatan jangka panjang. Ingatlah bahwa makan sehat adalah sebuah perjalanan, bukan diet ketat. Tujuannya adalah kemajuan—bukan kesempurnaan. Saat Anda membuat pilihan yang sadar secara konsisten, Anda akan merasa lebih baik, lebih kuat, dan lebih percaya diri dalam kehidupan sehari-hari Anda.

# article3Title
source: Managing Glucose Made Simple
id: Mengelola Glukosa Jadi Sederhana

# article3Preview
source: With the right choices, you can stay energized and prevent risks. Your health matters.
id: Dengan pilihan yang tepat, Anda bisa tetap berenergi dan mencegah risiko. Kesehatan Anda berharga.

# article3Caption
source: With the right choices, you can stay energized and prevent risks. Your health is in your hands.
id: Dengan pilihan yang tepat, Anda bisa tetap berenergi dan mencegah risiko. Kesehatan ada di tangan Anda.

# article3Content
source: Managing blood glucose doesn't have to be overwhelming. Understanding how food, physical activity, and daily habits affect your blood sugar can help you make better decisions. With the right approach, you can maintain stable energy levels and reduce the risk of long-term health problems. Carbohydrates have the biggest impact on blood sugar, so choosing the right type of carbs matters. Whole grains, beans, vegetables, and fruits offer slow and steady energy, unlike sugary snacks and processed foods that cause quick spikes and crashes. Balance is key—not elimination. Regular physical activity also helps your body use glucose more efficiently. Even simple movements like walking after meals, stretching, or doing light exercise can support healthier glucose levels. Consistency matters more than intensity. Monitoring your habits can help you understand what works best for your body. Pay attention to how certain meals, stress, or sleep patterns affect your energy. Small lifestyle adjustments can lead to big improvements. You have the power to take control of your health. By making mindful choices every day, you can protect your well-being, stay active longer, and feel confident in managing your glucose levels.
id: Mengelola glukosa darah tidak harus terasa membebani. Memahami bagaimana makanan, aktivitas fisik, dan kebiasaan sehari-hari memengaruhi gula darah Anda dapat membantu Anda membuat keputusan yang lebih baik. Dengan pendekatan yang tepat, Anda dapat mempertahankan tingkat energi yang stabil dan mengurangi risiko masalah kesehatan jangka panjang. Karbohidrat memiliki dampak terbesar pada gula darah, jadi memilih jenis karbohidrat yang tepat sangatlah penting. Biji-bijian utuh, kacang-kacangan, sayuran, dan buah-buahan menawarkan energi yang lambat dan stabil, tidak seperti camilan manis dan makanan olahan yang menyebabkan lonjakan dan penurunan cepat. Kuncinya adalah keseimbangan—bukan eliminasi. Aktivitas fisik yang teratur juga membantu tubuh Anda menggunakan glukosa secara lebih efisien. Bahkan gerakan sederhana seperti berjalan setelah makan, peregangan, atau melakukan olahraga ringan dapat mendukung kadar glukosa yang lebih sehat. Konsistensi lebih penting daripada intensitas. Memantau kebiasaan Anda dapat membantu Anda memahami apa yang terbaik untuk tubuh Anda. Perhatikan bagaimana makanan tertentu, stres, atau pola tidur memengaruhi energi Anda. Penyesuaian gaya hidup kecil dapat menghasilkan perbaikan besar. Anda memiliki kekuatan untuk mengendalikan kesehatan Anda. Dengan membuat pilihan yang sadar setiap hari, Anda dapat melindungi kesejahteraan Anda, tetap aktif lebih lama, dan merasa percaya diri dalam mengelola kadar glukosa Anda.

# article4Title
source: Your Guide to Everyday Wellness
id: Panduan Anda Menuju Kesehatan Sehari-hari

# article4Preview
source: Practical tips for a healthier, balanced life. Because health is wealth.
id: Tips praktis untuk hidup yang lebih sehat dan seimbang. Karena kesehatan adalah kekayaan.

# article4Caption
source: Practical tips for a healthier, balanced life. Because health is wealth.
id: Tips praktis untuk hidup yang lebih sehat dan seimbang. Karena kesehatan adalah kekayaan.

# article4Content
source: Wellness is not just about avoiding illness—it's about feeling your best physically, mentally, and emotionally. Taking simple steps each day can create a more balanced and fulfilling lifestyle. Healthy habits develop over time, one choice at a time. Start by fueling your body with nutritious food, staying hydrated, and maintaining regular meal patterns. A balanced diet supports stable moods, better focus, and improved immunity. Small habits like drinking enough water or choosing whole foods can make a big impact. Mental wellness is just as important as physical health. Taking breaks, practicing mindfulness, journaling, or spending time in nature can help reduce stress and improve emotional balance. Don't forget to rest—quality sleep allows your body and mind to recover. Movement is another essential part of wellness. Whether it's walking, dancing, yoga, or sports, find activities you enjoy so exercise feels rewarding—not forced. A strong body helps support an active and independent life. Most importantly, be kind to yourself. Wellness is personal and different for everyone. Progress may be slow, but consistency will help you build habits that last a lifetime. Your health truly is your greatest wealth.
id: Kesehatan (wellness) bukan hanya tentang menghindari penyakit—ini tentang merasa dalam kondisi terbaik secara fisik, mental, dan emosional. Mengambil langkah sederhana setiap hari dapat menciptakan gaya hidup yang lebih seimbang dan memuaskan. Kebiasaan sehat berkembang seiring waktu, satu pilihan pada satu waktu. Mulailah dengan memberi asupan makanan bergizi bagi tubuh Anda, tetap terhidrasi, dan menjaga pola makan yang teratur. Diet yang seimbang mendukung suasana hati yang stabil, fokus yang lebih baik, dan kekebalan tubuh yang meningkat. Kebiasaan kecil seperti minum cukup air atau memilih makanan utuh dapat memberikan dampak besar. Kesehatan mental sama pentingnya dengan kesehatan fisik. Mengambil istirahat, melatih perhatian penuh (mindfulness), menulis jurnal, atau menghabiskan waktu di alam dapat membantu mengurangi stres dan meningkatkan keseimbangan emosional. Jangan lupa istirahat—tidur yang berkualitas memungkinkan tubuh dan pikiran Anda untuk pulih. Gerakan adalah bagian penting lainnya dari kesehatan. Baik itu berjalan, menari, yoga, atau olahraga, temukan aktivitas yang Anda nikmati sehingga olahraga terasa bermanfaat—bukan terpaksa. Tubuh yang kuat membantu mendukung kehidupan yang aktif dan mandiri. Yang paling penting, bersikaplah baik pada diri sendiri. Kesehatan itu personal dan berbeda untuk setiap orang. Kemajuan mungkin lambat, tetapi konsistensi akan membantu Anda membangun kebiasaan yang bertahan seumur hidup. Kesehatan Anda benar-benar adalah kekayaan terbesar Anda.

# article5Title
source: Move Daily, Live Stronger
id: Bergerak Setiap Hari, Hidup Lebih Kuat

# article5Preview
source: Simple routines can transform your energy and health. Make movement your daily medicine.
id: Rutinitas sederhana dapat mengubah energi dan kesehatan Anda. Jadikan gerakan sebagai obat harian Anda.

# article5Caption
source: Simple routines can transform your energy and health. Make movement your daily medicine.
id: Rutinitas sederhana dapat mengubah energi dan kesehatan Anda. Jadikan gerakan sebagai obat harian Anda.

# article5Content
source: Movement is one of the best gifts you can give your body. Daily physical activity strengthens your muscles, supports heart health, improves flexibility, and boosts mood. You don't need a gym membership—just start where you are. Simple routines like walking, stretching, or taking the stairs can make a meaningful difference. Even 10 minutes of movement can increase circulation, reduce stiffness, and give you more energy throughout the day. Exercise also plays an important role in maintaining a healthy weight and managing blood sugar. When your body moves, it uses glucose as fuel, helping maintain balance and prevent spikes. Consistent movement keeps your metabolism active and efficient. Regular exercise benefits mental health as well. Physical activity triggers the release of endorphins—natural chemicals that reduce stress and increase happiness. Movement can help improve sleep, confidence, and overall mood. Make exercise something you look forward to, not a chore. Choose activities you enjoy, stay consistent, and celebrate small wins. The more you move, the stronger and healthier you become—one step at a time.
id: Gerakan adalah salah satu hadiah terbaik yang bisa Anda berikan kepada tubuh Anda. Aktivitas fisik harian memperkuat otot, mendukung kesehatan jantung, meningkatkan fleksibilitas, dan meningkatkan suasana hati. Anda tidak butuh keanggotaan gym—mulailah saja dari tempat Anda berada. Rutinitas sederhana seperti berjalan, peregangan, atau naik tangga dapat memberikan perbedaan yang bermakna. Bahkan 10 menit gerakan dapat meningkatkan sirkulasi, mengurangi kekakuan, dan memberi Anda lebih banyak energi sepanjang hari. Olahraga juga memainkan peran penting dalam menjaga berat badan yang sehat dan mengelola gula darah. Saat tubuh Anda bergerak, ia menggunakan glukosa sebagai bahan bakar, membantu menjaga keseimbangan dan mencegah lonjakan. Gerakan yang konsisten menjaga metabolisme Anda tetap aktif dan efisien. Olahraga teratur juga bermanfaat bagi kesehatan mental. Aktivitas fisik memicu pelepasan endorfin—kimia alami yang mengurangi stres dan meningkatkan kebahagiaan. Gerakan dapat membantu meningkatkan kualitas tidur, kepercayaan diri, dan suasana hati secara keseluruhan. Jadikan olahraga sesuatu yang Anda nantikan, bukan beban. Pilih aktivitas yang Anda nikmati, tetap konsisten, dan rayakan kemenangan kecil. Semakin banyak Anda bergerak, semakin kuat dan sehat Anda jadinya—satu langkah pada satu waktu.

# shareOptionsPrompt
source: Choose how to share your measurement results
id: Pilih cara membagikan hasil pengukuran

# shareAsPostSubtitle
source: Share as a post in GlucoTrack
id: Bagikan sebagai post di GlucoTrack

source: Other Apps
id: Aplikasi Lain

# socialAppsSubtitle
source: WhatsApp, Instagram, Facebook, etc
id: WhatsApp, Instagram, Facebook, dll

source: Sharing...
id: Membagikan...

# bloodGlucoseResult
source: Blood Glucose Measurement Result
id: Hasil Pengukuran Gula Darah

source: IoT Device (Invasive)
id: Perangkat IoT (Invasive)

source: Manual Glucometer
id: Glucometer Manual

# conditionLabel
source: Condition:
id: Kondisi:

# footerStayHealthy
source: 💙 Stay healthy with GlucoTrack
id: 💙 Jaga kesehatan Anda dengan GlucoTrack

source: Login
id: Masuk

source: Sign Up
id: Daftar

source: Welcome Back
id: Selamat Datang Kembali

# loginToAccount
source: Login to your account
id: Masuk ke akun Anda

# enterEmail
source: Enter your email
id: Masukkan email Anda

# enterPassword
source: Enter your password
id: Masukkan kata sandi Anda

source: Remember Me
id: Ingat Saya

source: Forgot Password?
id: Lupa Kata Sandi?

# dontHaveAccount
source: Don't have an account?
id: Belum punya akun?

# alreadyHaveAccount
source: Already have an account?
id: Sudah punya akun?

# emailPasswordRequired
source: Email and Password are required.
id: Email dan Kata Sandi wajib diisi.

# sessionNotActive
source: Session not active. Try again.
id: Sesi belum aktif. Coba lagi.

source: Login failed.
id: Gagal Masuk.

# enterEmailReset
source: Enter email for password reset.
id: Masukkan email untuk reset kata sandi.

# checkEmailReset
source: Check your email for reset instructions.
id: Cek email Anda untuk instruksi reset.

# createAccount
source: Create your new account
id: Buat akun baru Anda

# enterUsername
source: Enter your username
id: Masukkan nama pengguna Anda

source: Male
id: Laki-laki

source: Female
id: Perempuan

source: Birth Date
id: Tanggal Lahir

# createPassword
source: Create a password
id: Buat kata sandi

source: Confirm password
id: Konfirmasi kata sandi

# emailEmpty
source: Email cannot be empty
id: Email tidak boleh kosong

# usernameEmpty
source: Username cannot be empty
id: Nama pengguna tidak boleh kosong

# selectBirthDate
source: Select your birth date
id: Pilih tanggal lahir Anda

# passwordMismatch
source: Password confirmation does not match
id: Konfirmasi kata sandi tidak cocok

# registrationFailed
source: Registration failed. Check email/username or try again.
id: Pendaftaran gagal. Cek email/nama pengguna atau coba lagi.

# registrationSuccess
source: Registration successful! Please check your email.
id: Pendaftaran berhasil! Silakan cek email Anda.

source: Glucose Chart
id: Grafik Glukosa

source: History
id: Riwayat

source: Select Date
id: Pilih Tanggal

source: All
id: Semua

source: Low
id: Rendah

source: High
id: Tinggi

source: Weekly
id: Mingguan

source: Monthly
id: Bulanan

# noDataDateRange
source: No data for this date range
id: Tidak ada data pada rentang tanggal ini
